Консолидация/src/Documents/КорректировкиIFRS/КорректировкиIFRS.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КорректировкиIFRS</name>
  <registerRecords>InformationRegister.Корректировки</registerRecords>
  <attributes>
    <name>Коментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Аналитика</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КорректировкиPL</name>
    <attributes>
      <name>Статья</name>
      <type>
        <types>CatalogRef.СтатьиPL</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Коментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Консолидация/src/InformationRegisters/Корректировки/Корректировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Корректировки</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Аналитика</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Статья</name>
    <type>
      <types>CatalogRef.СтатьиPL</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидОтчета</name>
    <type>
      <types>EnumRef.ВидыОтчетов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Консолидация/src/Enums/ВидыОтчетов/ВидыОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОтчетов</name>
  <enumValues>
    <name>PL</name>
  </enumValues>
  <enumValues>
    <name>BS</name>
  </enumValues>
  <enumValues>
    <name>CF</name>
  </enumValues>
</mdclass:Enum>

Консолидация/src/Documents/КорректировкиIFRS/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ДвиженияКорректировкиIFRS = Движения.Корректировки;
	ДвиженияКорректировкиIFRS.Очистить();
	ДвиженияКорректировкиIFRS.Записывать = Истина;
	
	ТаблицаДвижений = ПодготовитьТаблицуДвиженийIFRS();

	ДвиженияКорректировкиIFRS.Загрузить(ТаблицаДвижений);

КонецПроцедуры

Функция ПодготовитьТаблицуДвиженийIFRS()
	
	ТЗдвижений = Движения.Корректировки.Выгрузить();
	ТЗдвижений.Очистить();
	
	Для Каждого Стр Из КорректировкиPL Цикл
		
		МассивПериодов = СформироватьМассивПериодов(стр.ДатаНачала, Стр.ДатаОкончания);
		
		Для Каждого СтрП из МассивПериодов Цикл
			
			СтрДвижения = ТЗдвижений.Добавить();
			СтрДвижения.Период = стрП;
			СтрДвижения.Регистратор = Ссылка;
			СтрДвижения.Организация = Организация;
			СтрДвижения.Статья      = Стр.Статья;
			СтрДвижения.ВидОтчета   = Перечисления.ВидыОтчетов.PL;
			СтрДвижения.Сумма       = Стр.Сумма;
			
		КонецЦикла;	
		
	КонецЦикла;	
	
	Возврат ТЗдвижений;
	
КонецФункции

Функция СформироватьМассивПериодов(ДатаНачала, ДатаОкончания)
	
	Период = НачалоМесяца(ДатаНачала);
	МассивПериодов = Новый Массив;
	
	Пока Период <= ДатаОкончания Цикл
		
		МассивПериодов.Добавить(Период);		
		Период = ДобавитьМесяц(Период, 1);
		
	КонецЦикла;	
	
	Возврат МассивПериодов;
	
КонецФункции
